PANDAS

Pandas Serisi Oluşturmak

In [1]:
import pandas as pd
pd.Series([2,3,4,5,6,8])

0    2
1    3
2    4
3    5
4    6
5    8
dtype: int64

In [2]:
seri = pd.Series([22,34,56,87,908,23])
type(seri)

pandas.core.series.Series

In [3]:
seri.axes

[RangeIndex(start=0, stop=6, step=1)]

In [4]:
seri.ndim

1

In [5]:
seri.values

array([ 22,  34,  56,  87, 908,  23])

In [6]:
seri

0     22
1     34
2     56
3     87
4    908
5     23
dtype: int64

In [7]:
seri.head(2)

0    22
1    34
dtype: int64

In [8]:
seri.tail(3)

3     87
4    908
5     23
dtype: int64

In [24]:
# İNDEX İSİMLENDİRMESİ

seri = pd.Series([22,34,56,87,908,23], index = ["a","b","c","d","e","f"])

In [10]:
seri

a     22
b     34
c     56
d     87
e    908
f     23
dtype: int64

In [11]:
# SÖZLÜK ÜZERİNDEN LİSTE OLUŞTURMAK

sozluk = {"reg":10, "log":11, "cart":12}
sozluk

{'reg': 10, 'log': 11, 'cart': 12}

In [13]:
# İKİ SERİYİ BİRLEŞTİREREK LİSTE OLUŞTURMA

pd.concat([seri,seri])

a     22
b     34
c     56
d     87
e    908
f     23
a     22
b     34
c     56
d     87
e    908
f     23
dtype: int64

Eleman İşlemleri

In [15]:
import numpy as np
a = np.array([154,25,530,49,58,67])
seri = pd.Series(a)
seri

0    154
1     25
2    530
3     49
4     58
5     67
dtype: int64

In [16]:
seri[2:4]

2    530
3     49
dtype: int64

In [18]:
list(seri.items())

[(0, 154), (1, 25), (2, 530), (3, 49), (4, 58), (5, 67)]

In [20]:
# ELEMAN SORGULAMA

"reg" in seri

False

In [ ]:
seri

In [25]:
# FANCY YALAŞIMI İLE ELEMAN SEÇME

seri[["a", "c"]]

a    22
c    56
dtype: int64

In [26]:
seri["a"] = 54

In [27]:
seri["a"]

54

In [28]:
seri["a":"f"]

a     54
b     34
c     56
d     87
e    908
f     23
dtype: int64

Pandas İle DataFrame Oluşturma

In [38]:
import pandas as pd
import numpy as np
a = np.array([[13,24,36],[42,51,64],[75,87,92]])
df = pd.DataFrame(a, columns=["1.sütun","2.sütun","3.sütun"])
df

   1.sütun  2.sütun  3.sütun
0       13       24       36
1       42       51       64
2       75       87       92

In [39]:
# SİLME İŞLEMLERİ

df.drop("1.sütun", axis = 1)

   2.sütun  3.sütun
0       24       36
1       51       64
2       87       92

In [40]:
df

   1.sütun  2.sütun  3.sütun
0       13       24       36
1       42       51       64
2       75       87       92

Gözlem ve Değişken Seçimi (loc & iloc)

In [41]:
# loc: TANIMLANDIĞI ŞEKLİYLE SEÇİM YAPMAK İÇİN KULLANILIR

df.loc[0:3]

   1.sütun  2.sütun  3.sütun
0       13       24       36
1       42       51       64
2       75       87       92

In [42]:
# iloc: ALIŞIK OLDUĞUMUZ İNDEXLEME MANTIĞIYLA SEÇİM YAPAR

df.iloc[0:3]

   1.sütun  2.sütun  3.sütun
0       13       24       36
1       42       51       64
2       75       87       92

Birleştirme (Join) İşlemleri

In [47]:
import pandas as pd
import numpy as np
a = np.array([[13,24,36,56,78],[677,4785,4672,5671,6456],[75,4545,879,87,92]])
df = pd.DataFrame(a, columns=["1.sütun","2.sütun","3.sütun","4.sütun","5.sütun"])
df

   1.sütun  2.sütun  3.sütun  4.sütun  5.sütun
0       13       24       36       56       78
1      677     4785     4672     5671     6456
2       75     4545      879       87       92

In [48]:
import pandas as pd
import numpy as np
a = np.array([[143,254,3346,5566,748],[67567,475485,46572,56471,645236],[752,452345,87349,8734,932]])
df2 = pd.DataFrame(a, columns=["1.sütun","2.sütun","3.sütun","4.sütun","5.sütun"])
df2

   1.sütun  2.sütun  3.sütun  4.sütun  5.sütun
0      143      254     3346     5566      748
1    67567   475485    46572    56471   645236
2      752   452345    87349     8734      932

In [49]:
pd.concat([df,df2])

   1.sütun  2.sütun  3.sütun  4.sütun  5.sütun
0       13       24       36       56       78
1      677     4785     4672     5671     6456
2       75     4545      879       87       92
0      143      254     3346     5566      748
1    67567   475485    46572    56471   645236
2      752   452345    87349     8734      932

In [58]:
pd.concat([df,df2], ignore_index=True)

   1.sütun  2.sütun  3.sütun  4.sütun  5.sütun
0       13       24       36       56       78
1      677     4785     4672     5671     6456
2       75     4545      879       87       92
3      143      254     3346     5566      748
4    67567   475485    46572    56471   645236
5      752   452345    87349     8734      932

İleri Birleştirme İşlemleri

In [109]:
df1 = pd.DataFrame({'calisanlar': ['Caner','Mustafa','Ufuk','Ayse']
                   ,'grup': ['Muhasebe','Muhendislik','Muhendislik','IK']})
df1

  calisanlar         grup
0      Caner     Muhasebe
1    Mustafa  Muhendislik
2       Ufuk  Muhendislik
3       Ayse           IK

In [110]:
df2 = pd.DataFrame({'calisanlar': ['Caner','Mustafa','Ufuk','Ayse'],
                  'ilk_giris' : [2010,2009,2015,2019]})
df2

  calisanlar  ilk_giris
0      Caner       2010
1    Mustafa       2009
2       Ufuk       2015
3       Ayse       2019

In [111]:
# BİREBİR BİRLEŞTİRME

pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0      Caner     Muhasebe       2010
1    Mustafa  Muhendislik       2009
2       Ufuk  Muhendislik       2015
3       Ayse           IK       2019

In [106]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0      Caner     Muhasebe       2010
1    Mustafa  Muhendislik       2009
2       Ufuk  Muhendislik       2015
3       Ayse           IK       2019

In [114]:
df4 = pd.DataFrame({'grup': ['IK','Muhendislik','Muhasebe'],
                  'mudur' : ['Ozan','Merve','Hasan']})
df4

          grup  mudur
0           IK   Ozan
1  Muhendislik  Merve
2     Muhasebe  Hasan

In [115]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris  mudur
0      Caner     Muhasebe       2010  Hasan
1    Mustafa  Muhendislik       2009  Merve
2       Ufuk  Muhendislik       2015  Merve
3       Ayse           IK       2019   Ozan

In [119]:
# ÇOKTAN AZA BİRLEŞTİRME
df5 = pd. DataFrame({'grup': ['Muhasebe', 'Muhasebe','Muhendislik', 'Muhendislik', 'IK','IK'],
'yetenekler': ['matematik', 'excel', 'kodlama','linux','excel', 'yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [120]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0      Caner     Muhasebe  matematik
1      Caner     Muhasebe      excel
2    Mustafa  Muhendislik    kodlama
3    Mustafa  Muhendislik      linux
4       Ufuk  Muhendislik    kodlama
5       Ufuk  Muhendislik      linux
6       Ayse           IK      excel
7       Ayse           IK    yonetim

Toplulaştırma ve Gruplandırma

In [1]:
import seaborn as sns
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [2]:
df.mean()

/var/folders/3p/nkjxyr015s51jn9nnd9lkqm40000gn/T/ipykernel_64662/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [4]:
# VERİ SETİNDEKİ TÜM BETİMSEL İSTATİSTİKLERİ SERGİLER

df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [6]:
# TRANSPOZ ALMA

df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [7]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

Gruplandırma İşlemleri

In [3]:
import pandas as pd
import seaborn as sns
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [4]:
df.groupby("method")["orbital_period"].mean() # ORTALAMASINI ALDIM

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [4]:
# Bütün Değerler

df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

İleri Toplulaştırma ve Dönüştürme İşlemleri (aggregate,filter,transform,apply)

In [5]:
df = pd.DataFrame({'gruplar':['a','b','c','d','e'],
                    'degisken1':[10,30,44,34,55],
                    'degisken2':[100,400,333,245,567]},
                    columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         30        400
2       c         44        333
3       d         34        245
4       e         55        567

In [6]:
# (aggregate) Toplulaştırma
import numpy as  np
df.groupby("gruplar").aggregate([max, np.median, "min"])

        degisken1            degisken2
              max median min       max median  min
gruplar
a              10   10.0  10       100  100.0  100
b              30   30.0  30       400  400.0  400
c              44   44.0  44       333  333.0  333
d              34   34.0  34       245  245.0  245
e              55   55.0  55       567  567.0  567

In [7]:
df.groupby("gruplar").aggregate({'degisken1': min,  'degisken2': max})

         degisken1  degisken2
gruplar
a               10        100
b               30        400
c               44        333
d               34        245
e               55        567